# AlignmentService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..AlignmentService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
Autodesk Internal: The service for Infrastructure Alignments
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId AlignmentService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlignmentService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ AlignmentService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace